local _, C = unpack(select(2, ...))

-- Raidbuff Checklist
C.RaidUtilityBuffCheckList = {
	[1] = {		-- 合剂
		17627,	-- 精炼智慧
		28518,	-- 强固合剂
		28519,	-- 强效回复合剂
		28520,	-- 无情突袭合剂
		28521,	-- 盲目光芒合剂
		28540,	-- 纯粹死亡合剂
		42735,	-- 多彩奇迹
		-- 战斗药剂
		33726,	-- 掌控药剂
		11406,	-- 屠魔药剂
		38954,	-- 魔能力量药剂
		33721,	-- 魔能药剂
		17539,	-- 强效奥法药剂
		28491,	-- 治疗能量
		-- 守护药剂
		28502,	-- 特效护甲
		39625,	-- 特效坚韧药剂
		39626,	-- 土灵药剂
		28514,	-- 增效
		28509,	-- 强效法力回复
		39627,	-- 德莱尼智慧药剂
	},
	[2] = { -- 进食充分
		104273, -- 250敏捷，BUFF名一致
	},
	[3] = { -- 10%智力
		1459,
		264760,
	},
	[4] = { -- 10%耐力
		21562,
		264764,
	},
	[5] = { -- 10%攻强
		6673,
		264761,
	},
	[6] = { -- 符文
		270058,
	},
}